# -*- coding: utf-8 -*-
import random
import math

def input_infinity_list(list_def: list, keyword: str):
    while True:
        list_def.append(input('Вводите элементы списка. Когда закончите, введите в поле ввода "EXIT"\n'))
        if list_def[-1] == keyword:  # проверка на ключевое слово EXIT
            list_def.pop()  # убираем EXIT из списка
            print('Ваш исходный список: ', list_def)  # выводим данный список
            break  # выходим из бесконечного цикла (приходится так делать, ведь do-while в phyton нет(((
        elif not list_def[-1].isalpha():  # преобразуем строку в число для дальнейших математических операций
            # (введённые числа преобразуются в строку с помощью input)
            if float(list_def[-1]) % 1 == 0:
                list_def[-1] = int(float(list_def[-1]))
            else:
                list_def.pop()
                print('Можно вводить только целые числа')
        else:
            list_def.pop()
            print('Можно вводить только целые числа')

# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]

list_input = []
list_inputSQRT = []

input_infinity_list(list_input, 'EXIT')
# думал, что так получится короче, но оказалось только сложнее:
'''
for i in list_input: 
    if list_input[list_input.index(i)] > 0:
        if math.sqrt(list_input[list_input.index(i)]) % 1 == 0:
            list_inputSQRT.append(int(math.sqrt(list_input[list_input.index(i)])))
            '''
#  пока писал это, подумал, как было бы удобно написать это на C++ с помощью for:
'''
i = 0
while i < len(list_input):  # 
    if list_input[i] > 0 and math.sqrt(list_input[i]) % 1 == 0:  # корни должны извлекаться только из
        # неотрицательных чисел и являться целыми числами
        list_inputSQRT.append(int(math.sqrt(list_input[i])))
    i += 1
'''
#  аналог цикла for из C++:

for i in range(0, (len(list_input))):
    if list_input[i] > 0 and math.sqrt(list_input[i]) % 1 == 0:  # корни должны извлекаться только из
        # неотрицательных чисел и являться целыми числами
        list_inputSQRT.append(int(math.sqrt(list_input[i])))
print("Ваш список с хорошими корнями: ", list_inputSQRT)

# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)

dmy = input("Введите дату в формате dd.mm.yyyy\n")  # 26.08.2003
dmy_list = []
for i in range(0, 10):
    if dmy[i] != ".":
        dmy_list.append(dmy[i])

d_dict_0 = {'1': 'первое', '2': 'второе', '3': 'третье',
            '4': 'четвёртое', '5': 'пятое', '6': 'шестое', '7': 'седьмое', '8': 'восьмое', '9': 'девятое'}
d_dict_10 = {'0': 'десятое', '1': 'одиннадцатое', '2': 'двенадцатое',
             '3': 'тринадцатое', '4': 'четырнадцатое', '5': 'пятнадцатое', '6': 'шестнадцатое',
             '7': 'семнадцатое', '8': 'восемнадцатое', '9': 'девятнадцатое'}
m_dict = {'01': 'января', '02': 'февраля', '03': 'марта', '04': 'апреля', '05': 'мая', '06': 'июня', '07': 'июля'
          , '08': 'августа', '09': 'сентября', '10': 'октября', '11': 'ноября', '12': 'декабря'}

if dmy_list[0] == '0':
        d = d_dict_0[dmy_list[1]]
elif dmy_list[0] == '1':
        d = d_dict_10[dmy_list[1]]
elif dmy_list[0] == '2':
    if dmy_list[1] != '0':
        d = 'двадцать ' + str(d_dict_0[dmy_list[1]])
    else:
        d = 'двадцатое'
elif dmy_list[0] == '3':
    if dmy_list[1] != '0':
        d = 'тридцать' + str(d_dict_0[dmy_list[1]])
    else:
        d = 'тридцатое'

m = m_dict[dmy_list[2] + dmy_list[3]]

y = (dmy_list[4] + dmy_list[5] + dmy_list[6] + dmy_list[7]) + ' года'

print(d, m, y)

# Задача-3: Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random

random_list = []
n = input('Введите количество элементов списка\n')
for i in range(0, int(n)):
    random_list.append(random.randint(-100, 100))
print(random_list)

# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут: 
# а) неповторяющиеся элементы исходного списка:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 2, 4, 5, 6]
# б) элементы исходного списка, которые не имеют повторений:
# например, lst = [1 , 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 4, 6]

list_4 = []
input_infinity_list(list_4, 'EXIT')

list_4_a = []
list_4_a_exceptions = []
for i in range(0, len(list_4)):
    if list_4[i] not in list_4_a:
        list_4_a.append(list_4[i])
    else:
        list_4_a_exceptions.append(list_4[i])
list_4_a_exceptions = sorted(set(list_4_a_exceptions))
print(list_4_a_exceptions)
list_4_a_text = 'а) Ваш список с неповторяющимися элементми исходного списка: ' + str(list_4_a)

list_4_b = []
for i in range(0, len(list_4)):
    if list_4[i] not in list_4_a_exceptions:
        list_4_b.append(list_4[i])
list_4_b_text = 'б) Ваш список с элементми исходного списка, которые не имеют повторений: ' + str(list_4_b)

print(list_4_a_text + '\n' + list_4_b_text)
